
RUIDefaultDeviceName							= "TV";

OK												= "OK";
Next											= "Seuraava";
Cancel											= "Kumoa";

ResumeMenuResumeItem							= "Jatka toistamista";
ResumeMenuStartFromBeginningItem				= "Aloita alusta";

ITSPresentsMenuItem								= "iTunesin 10 suosituinta";
ITunesTop10MusicVideos							= "iTunesin 10 suosituinta musiikkivideota";
LoadingDataFromITMS								= "Yhdistetään iTunes Storeen…";
LoadingDataFromApple							= "Ladataan elokuvaesittelyitä…";

PhotoModuleAllSubAlbumsMenuItem					= "Kaikki";
PhotoModuleSharedAlbumsMenuItem					= "Jaetut valokuvat";
PhotoModuleFetchingServersMenuItem				= "Etsitään jaettuja valokuvia…";
PhotoModuleNoServersMenuItem					= "Jaettuja valokuvia ei ole käytettävissä";
PhotoModuleNoServersExplanation					= "Jaettuja iPhoto-kirjastoja ei ole tällä hetkellä käytettävissä.";
PhotoWindowHeader								= "Valokuvat";
NoPhotosInAlbumMessage							= "Tässä albumissa ei ole valokuvia.";
PhotoSlideshowSettings							= "Kuvaesitysasetukset";

// Slideshow Settings:

PhotoSlideshowSettingTimePerSlide				= "Aika kuvaa kohden";
PhotoSlideshowSettingMusic						= "Musiikki";
PhotoSlideshowSettingRepeat						= "Toista";
PhotoSlideshowSettingShufflePhotos				= "Sekoita valokuvat";
PhotoSlideshowSettingShuffleMusic				= "Sekoita musiikki";
PhotoSlideshowSettingKenBurns					= "Ken Burns -tehoste";
PhotoSlideshowSettingTransitions				= "Siirrokset";
PhotoSlideshowSettingTimeFormat					= "%d sekuntia"; // examples: 3 seconds, 5 seconds, 10 seconds

PhotoSettingRandomTransitions					= "Satunnainen";
PhotoSettingNoTransitions						= "Pois päältä";
Cube											= "Kuutio";
Dissolve										= "Ristikuva";
Droplet											= "Pisara";
"Fade Through Black"							= "Häivytä mustan kautta";
Flip											= "Käännä";
"Mosaic Flip Large"								= "Mosaiikkikääntö suuri";
"Mosaic Flip Small"								= "Mosaiikkikääntö pieni";
"Page Flip"										= "Sivun kääntö";
Push											= "Työntö";
Reveal											= "Paljasta";
Twirl											= "Pyörre";
Wipe											= "Pyyhkäisy";

PhotoSlideshowSettingMusicNowPlaying			= "Nyt toistetaan";

PhotoSettingOff									= "Pois päältä";
PhotoSettingOn									= "Päällä";

TVShowsHourMinuteSecondFormat					= "%d:%02d:%02d";
TVShowsMinuteSecondFormat						= "%d:%02d";
TVShowsUnknownShow								= "Nimetön";
SortWidgetDateLabel								= "Päivämäärä";
SortWidgetShowLabel								= "Ohjelma";

/* Metadata strings */
ActorsSeparator									= ", ";

MetadataLabelSeparator							= ":";

MetadataCast									= "Näyttelijät";
MetadataDuration								= "Pituus";
MetadataAirDate									= "Lähetetty";
MetadataReleaseDate								= "Julkaistu";
MetadataInTheatres								= "Teattereissa";
MetadataArtist									= "Artisti";
MetadataAlbum									= "Albumi";
MetadataGenre									= "Laji";
MetadataNumberOfEpisodes						= "Jaksojen määrä";
MetadataNumberOfTracks							= "Raidat";
MetadataMostRecent								= "Uusin";
MetadataDirector								= "Ohjaaja";
MetadataDirectors								= "Ohjaajat";
MetadataProducer								= "Tuottaja";
MetadataProducers								= "Tuottajat";
MetadataArtistVarious							= "Useita";
MetadataArtistUnknown							= "Tuntematon artisti";
MetadataAlbumUnknown							= "Tuntematon albumi";
MetadataPlaylistUnknown							= "Tuntematon soittolista";
MetadataComposerUnknown							= "Tuntematon säveltäjä";
MetadataGenreUnknown							= "Tuntematon laji";
MetadataAuthor									= "Tekijä";
MetadataTitle									= "Otsikko";
MetadataEpisode									= "Jakso";
MetadataSeasonFormat							= "(Kausi %d)";
MetadataFrom									= "Lähettäjä";
MetadataTags									= "Tagit";
MetadataViews									= "Näkymät";
MetadataDateAdded								= "Lisätty";
MetadataCategory								= "Kategoria";

/* Rating strings */
RatingExplicit									= "Mahdollisesti loukkaavaa";

MediaTitleDefault								= "Nimetön";

StreamingNameInList								= "Lähetetään";
StreamingSearchingForSharedMedia				= "Etsitään jaettua sisältöä…";

TodayDate										= "Tänään";
YesterdayDate									= "Eilen";

GoBackText										= "Palaa painamalla Menu";

/* key is always the same, value is language key like ru, Spanish, etc */
UseMe											= "fi";

AuthPasswordPrompt								= "Salasana:";
AuthEnterPasswordPrompt							= "Syötä salasana kohteelle %@:";

TextInputDoneLabel								= "VALMIS";
TextInputDeleteLabel							= "POISTA";
TextInputSpaceLabel								= "VÄLI";

AlternateTextInputSpaceLabel					= "Väli";
AlternateTextInputDeleteLabel					= "Poista";
TextInputMoreSymbolsLabel						= "#+=";
TextInputMoreCharactersLabel					= "abc";

/* all the items in this group are old and will be replaced with non-Module versions */

MusicNameInList									= "Musiikki";
MusicPlaylistsMenuItem							= "Soittolistat";
MusicArtistsMenuItem							= "Artistit";
MusicAlbumsMenuItem								= "Albumit";
MusicSongsMenuItem								= "Kappaleet";
MusicPodcastsMenuItem							= "Podcastit";
MusicMusicVideosMenuItem						= "Musiikkivideot";
MusicGenresMenuItem								= "Lajit";
MusicComposersMenuItem							= "Säveltäjät";
MusicAudiobooksMenuItem							= "Äänikirjat";
MusicShuffleSongsMenuItem						= "Sekoita kappaleet";
MusiciTunesPresentsMenuItem						= "iTunes Store esittää";
MusicNowPlayingMenuItem							= "Nyt toistetaan";
MusicCDMenuItem									= "%@";
MusicCDEjectMenuItem							= "Anna CD";
MusicSharedMusicMenuItem						= "Jaettu musiikki";
MusicSpecialPlaylistName						= "Front Row -soittolista";
MusicAllAlbumsListHeader						= "Kaikki albumit";
MusicAllSongsListHeader							= "Kaikki kappaleet";
MusicAllArtistsListHeader						= "Kaikki artistit";
MusicAllTracksListSpecifier						= "Kaikki";
MusicUntitledTrack								= "Nimetön raita";
MusicNoSharedPlaylistsMenuItem					= "Musiikkia ei ole saatavilla";
MusicTrackIndexOfCount							= "%ld / %ld";

/* radio-specific music strings*/
MusicRadioBufferingText							= "Puskuroidaan lähetystä ”%@”";

TrailerNegativeTimeChar							= "-";
TrailerHourMinuteSecondFormat					= "%@%01d:%02d:%02d";
TrailerMinuteSecondFormat						= "%@%01d.%02d";

GenericError                                    = "Tapahtui virhe.";
GenericListError								= "Luettelossa ei ole kohteita.";

WaitPleaseWait									= "Odota";
WaitContactingRemoteHost						= "Yhdistetään iTunes-etäpalvelimeen…";

WirelessSetupSearchText							= "Etsitään langattomia verkkoja…";
NotConnectedToInternet							= "Apple TV ei ole yhteydessä internetiin.";
NotConnectedToNetwork							= "Apple TV ei ole yhteydessä verkkoon.";
CheckNetworkConnection							= "Tarkista verkkoasetukset ja yritä uudelleen.";
UntitledWirelessNetworkName						= "-";

// iTunesPairing Strings
PairWithITunesTitle								= "Yhdistä iTunesiin";

PairWithITunesForInitialSyncingDescription		= "Viimeistele käyttöönotto ja synkronoi iTunes-sisältö Apple TV:hen avaamalla iTunes ja valitse Laitteet-luettelosta Apple TV. Syötä tämä pääsykoodi:";
PairWithITuneForInitialSyncingSkipPairingLabel	= "Jos haluat käyttää Apple TV:tä vain lähetysten vastaanottoon, paina Menu ja valitse Lähteet-valikosta Yhdistä iTunesiin.";

PairWithITunesForSyncingDescription				= "Yhdistä iTunesiin ja synkronoi sisältö Apple TV:hen avaamalla iTunes ja valitse Laitteet-luettelosta Apple TV. Syötä tämä pääsykoodi:";
PairWithITunesForSyncingDescriptionWhenCurrentlyPaired	= "Apple TV on tällä hetkellä liitetty kirjastoon ”%@”. Jos haluat liittää sen eri kirjastoon, avaa iTunes tietokoneella, jossa kirjasto on, ja valitse Laitteet-luettelosta Apple TV. Tämä korvaa Apple TV:n sisällön. Syötä tämä pääsykoodi:";

PairWithITunesForSyncingSkipPairingLabel		= "";

PairWithITunesForStreamingDescription			= "Lähetä iTunes-sisältöä Apple TV:hen avaamalla iTunes ja valitse Laitteet-luettelosta Apple TV. Syötä tämä pääsykoodi:";
PairWithITunesStreamingSkipPairingLabel			= "";

PairWithITunesTurningOffSyncingWarning			= "Synkronoinnin laittaminen pois päältä poistaa kaiken Apple TV:n sisällön.";
PairWithITunesChangingSyncingHostWarning		= "iTunes-kirjaston vaihtaminen korvaa kaiken Apple TV:n sisällön.";

PairWithITunesRequirementLabel					= "Apple TV vaatii iTunes 7.1.1:n tai uudemman";
PairWithITunesCancel							= "Kumoa";
PairWithITunesContinue							= "Jatka";


// These are the strings for a fatal error alert.  The user will basically have the option to cancel or restart the app
FatalExceptionAlertTitle						= "Tapahtui virhe.";
FatalExceptionAlertDescription					= "Käynnistä Apple TV uudelleen painamalla Play/Pause.";

// These are UI strings for various timings
720p60											= "720p HD";
720p50											= "720p HD - 50 Hz";
1080i60											= "1080i HD";
1080i50											= "1080i HD - 50 Hz";
1080p60											= "1080p HD";
1080p50											= "1080p HD - 50 Hz";
480p60											= "480p";
576p50											= "576p - 50 Hz ";
576i											= "576i - 50 Hz";

// Loading data from remote sources
LoadingLibrary									= "Yhdistetään";
LoadingLibraryNamed								= "Ladataan ”%@”…";
ConnectionToiTunesLost							= "iTunes-kirjasto ei ole käytettävissä";
WaitingForiTunesToStart							= "Yritetään uudelleen yhdistää kohteeseen ”%@”. Varmista, että tietokone on päällä ja iTunes avoinna.";
GoToSources										= "Siirry Lähteisiin";
AttemptingToAuthorizeContent					= "Yritetään valtuutusta…";

SharedITunesLibraryPasswordTitle				= "Jaetun kirjaston salasana";
SharedITunesLibraryPasswordText					= "Syötä salasana kohteelle ”%@” ja osoita Valmis.";
SharedITunesLibraryPasswordPrompt				= "Salasana:";
SharedITunesLibraryPasswordRetryTitle			= "Virheellinen salasana";
SharedITunesLibraryPasswordRetryText			= "Kohteelle ”%@” syötetty salasana on virheellinen.\nYritä uudelleen.";

SharedIPhotoLibraryPasswordTitle				= "Valokuvakirjaston salasana";
SharedIPhotoLibraryPasswordText					= "Syötä salasana kohteelle ”%@” ja osoita Valmis.";
SharedIPhotoLibraryPasswordPrompt				= "Salasana:";
SharedIPhotoLibraryPasswordRetryTitle			= "Virheellinen salasana";
SharedIPhotoLibraryPasswordRetryText			= "Kohteelle ”%@” syötetty salasana on virheellinen.\nYritä uudelleen.";

ConnectToITunesForStreaming						= "Yhdistä uuteen iTunesiin";
StreamingServerNotAvailable						= "Kirjasto ei ole käytettävissä";
TurnOnStreamingServer							= "Varmista, että kohteen ”%@” sisältävä tietokone on päällä ja että iTunes on avoinna.";
DisconnectStreamingHost							= "Katkaise yhteys iTunesiin";
MaxStreamingHostCountReached					= "Voit yhdistää vain viiteen iTunes-kirjastoon. Valitse kirjasto, jonka yhteys katkaistaan, jotta voit yhdistää uuteen kirjastoon.";
SelectHostToDelete								= "Yhdistä uuteen iTunesiin.";

// Messages shown above sync progress indicator during syncing:
BRSyncProgressSourceTextFormat					= "Synkronoidaan ”%@”"; // %@ is name of iTunes library
BRSyncProgressAssetTextFormat					= "Kopioidaan %d / %d: %@"; // Example: Copying 123 of 295: Finding Nemo

// Parental Controls passcode text
BRParentalControlsPasscodeEnterTitle			= "Syötä pääsykoodi";
BRParentalControlsPasscodeEnterPrompt			= "Syötä nelinumeroinen käyttörajoitusten pääsykoodi.";
BRParentalControlsPasscodeWrongTitle			= "Pääsykoodi virheellinen";
BRParentalControlsPasscodeWrongPrompt			= "Syötetty pääsykoodi on virheellinen.";
BRParentalControlsPasscodeSetTitle				= "Aseta pääsykoodi";
BRParentalControlsPasscodeSetPrompt				= "Jos haluat asettaa käyttörajoituksia Apple TV:hen ensimmäistä kertaa, syötä nelinumeroinen pääsykoodi. Kun pääsykoodi on asetettu, se on syötettävä, jotta käyttörajoituksiin voidaan tehdä muutoksia.";
BRParentalControlsPasscodeConfirmTitle			= "Vahvista pääsykoodi";
BRParentalControlsPasscodeConfirmPrompt			= "Syötä nelinumeroinen pääsykoodi uudelleen.";
BRParentalControlsPasscodeConfirmedTitle		= "Pääsykoodi varmistettu";
BRParentalControlsPasscodeConfirmedPrompt		= "Säilytä pääsykoodi turvallisessa paikassa. Jos unohdat pääsykoodin, voit palauttaa Apple TV:n sen alkuperäiseen tilaan valitsemalla Tehdaspalautus.";
BRParentalControlsPasscodeMismatchTitle			= "Pääsykoodi ei täsmää";
BRParentalControlsPasscodeMismatchPrompt		= "Syötetty pääsykoodi ei täsmää.";
BRParentalControlsPasscodeTryAgainItem			= "Aseta pääsykoodi uudelleen";
BRParentalControlsPasscodeOldTitle				= "Vanha pääsykoodi";
BRParentalControlsPasscodeOldPrompt				= "Syötä vanha nelinumeroinen pääsykoodi.";
BRParentalControlsPasscodeChangeTitle			= "Uusi pääsykoodi";
BRParentalControlsPasscodeChangePrompt			= "Syötä nelinumeroinen pääsykoodi.";

// Syncing text
BRSettingSyncing								= "Synkronoidaan";
BRSettingTurnOnSyncing							= "Laita synkronointi päälle";
BRSettingTurnOffSyncing 						= "Laita synkronointi pois päältä";
BRSettingChangeITunesLibrary 					= "Vaihda iTunes-kirjastoa";

// Combo Row text
AssetViewFormat									= "%@ näkymä";
AssetViewsFormat								= "%@ näkymää";

BRDVDLoadingText								= "Ladataan DVD:tä…";
BRDVDMenuItemResume								= "Jatka toistamista";
BRDVDMenuStartFromBeginning						= "Aloita alusta";
BRDVDMenuItemEjectDisk							= "Anna levy";
BRDVDMenuItemDVDMenu							= "DVD-valikko";
BRDVDPlayerChapterFormatter                     = "Kappale %d / %d";

// Account Management text
BRAccountSelectorOtherAccount					= "Muu…";

// HDCP Error dialog
HDCPErrorDialogTitle							= "Ei HDCP:tä";
HDCPErrorDialogExplanation						= "Tämän sisällön toistoon vaaditaan HDCP. Jotta voit katsoa sisältöä, varmista, että liitetyt näytöt tukevat HDCP:tä.";


